Revit 2026 API

# FilteredWorksetCollector Constructor

---

Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredWorksetCollector(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
FilteredWorksetCollector(
	Document^ document
)
```
```fsharp
new :
        document : Document -> FilteredWorksetCollector
```

#### Parameters

document Document
     The document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace